Revit 2027 API
ParameterTypeId.RampMaxRunLength Property
 "Maximum Incline Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RampMaxRunLength { get; }
Public Shared ReadOnly Property RampMaxRunLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RampMaxRunLength {
	ForgeTypeId^ get ();
}
static member RampMaxRunLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace